app/controllers/blogs_controller.rb

  def show
    @blog = Blog.find(params[:id])
---
SELECT `blogs`.* FROM `blogs` WHERE (`blogs`.`id` = 1) LIMIT 1