app/controllers/classifieds_controller.rb

  def show
    @classified = Classified.find(params[:id])
---
SELECT `classifieds`.* FROM `classifieds` WHERE (`classifieds`.`id` = 2) LIMIT 1

  def edit
    @classified = Classified.find(params[:id])
---
SELECT `classifieds`.* FROM `classifieds` WHERE (`classifieds`.`id` = 1) LIMIT 1

  def destroy
    Classified.find(params[:id]).destroy
---
DELETE FROM `classifieds` WHERE (`classifieds`.`id` = 2)
SELECT `classifieds`.* FROM `classifieds` WHERE (`classifieds`.`id` = 2) LIMIT 1

  def update
    @classified = Classified.find(params[:id])
    if @classified.update_attributes(params[:classified])
---
SELECT `classifieds`.* FROM `classifieds` WHERE (`classifieds`.`id` = 1) LIMIT 1
UPDATE `classifieds` SET `title` = 'Macromedia 6.0', `updated_at` = '2012-01-11 10:52:35' WHERE (`classifieds`.`id` = 1)

  def create
    @classified = Classified.new(params[:classified])
    if @classified.save
---
INSERT INTO `classifieds` (`email`, `photo_updated_at`, `title`, `created_at`, `photo_file_size`, `location`, `description`, `photo_file_name`, `price`, `photo_content_type`, `updated_at`) VALUES ('email334@yahoo.com', '2012-01-12 10:34:44', 'efg', '2012-01-12 10:34:44', 4961, 'fg', 'gfg', 'UltraHeat.jpg', 123.0, 'image/jpeg', '2012-01-12 10:34:44')