app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM `users` WHERE (`users`.`id` = 1)
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`updated_at`, `email`, `name`, `created_at`, `password`) VALUES ('2012-02-02 11:51:25', 'ma@veriqual.com', 'M. Mohsin Ali', '2012-02-02 11:51:25', '321321')